# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка

max_len_str = 0
for fruit in fruits:
    ln = len(fruit)
    if ln> max_len_str:
        max_len_str = ln

i = 1
for fruit in fruits:
    print(i, " " * (max_len_str - len(fruit)), fruit)
    i += 1
