# Дан файл ("data/fruits.txt") со списком фруктов.
# Записать в новые файлы все фрукты, начинающиеся с определенной буквы.
# Т.е. в одном файле будут все фрукты на букву “А”, во втором на “Б” и т.д.
# Файлы назвать соответственно.
# Пример имен файлов: fruits_А.txt, fruits_Б.txt, fruits_В.txt ….
# Важно! Обратите внимание, что нет фруктов, начинающихся с некоторых букв.
# Напишите универсальный код, который будет работать с любым списком фруктов и
# распределять по файлам в зависимости от первых букв, имеющихся в списке фруктов.
# Подсказка:
# Чтобы получить список больших букв русского алфавита:
# print(list(map(chr, range(ord('А'), ord('Я')+1))))

with open('data/fruits.txt', 'r', encoding='utf-8') as f:
    for my_line in f:
        for fruit in list(map(chr, range(ord('А'), ord('Я') + 1))):
            if fruit ==  my_line[0]:
                print(fruit , my_line )
                with open("data/fruits_"+fruit+".txt", 'a', encoding='utf-8') as f1:
                    f1.write(my_line)
